In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('../data/sat-scores.csv',
    usecols=['Year', 
         'State.Code',
        'Total.Math', 
        'Total.Test-takers',
        'Total.Verbal'],
    index_col=['Year', 'State.Code'])
#df = df.set_index(['Year', 'State.Code'])
df

                 Total.Math  Total.Test-takers  Total.Verbal
Year State.Code
2005 AL                 559               3985           567
     AK                 519               3996           523
     AZ                 530              18184           526
     AR                 552               1600           563
     CA                 522             186552           504
...                     ...                ...           ...
2015 VA                 517              59621           518
     WA                 511              44423           502
     WV                 500               2501           509
     WI                 606               2277           591
     WY                 587                181           588

[577 rows x 3 columns]

In [3]:
df.loc[(2010, ['NY', 'NJ', 'MA', 'IL']), 'Total.Math'].mean()

np.float64(535.25)

In [4]:
df.loc[2005, 'Total.Test-takers'].sum()

np.int64(1344824)

In [5]:
df.loc[(2010, ['NY', 'NJ', 'MA', 'IL']), 'Total.Math'].mean()

np.float64(535.25)

In [6]:
df.loc[([2012,2013,2014,2015], ['AZ', 'CA', 'TX']), 'Total.Math'].mean()

np.float64(511.5833333333333)

In [7]:
df.loc[(slice(None), ['FL', 'IN', 'ID']), ['Total.Math', 'Total.Verbal']].mean()

Total.Math      507.090909
Total.Verbal    504.606061
dtype: float64

In [8]:
df.loc[df['Total.Verbal'] == df['Total.Verbal'].max()]

                 Total.Math  Total.Test-takers  Total.Verbal
Year State.Code
2013 ND                 613                174           612

In [9]:
df['Total.Verbal'].idxmax()

(np.int64(2013), 'ND')

In [10]:
df.loc[2005, 'Total.Math'].mean() - df.loc[2015, 'Total.Math'].mean()

np.float64(2.559506531204647)